app/controllers/coffees_controller.rb

SELECT "coffees".* FROM "coffees"
---
    def index
        coffees = Coffee.all

SELECT "coffees".* FROM "coffees" WHERE "coffees"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        coffee = Coffee.find(params[:id])

INSERT INTO "coffees" ("flavor", "category", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["flavor", "espresso"], ["category", "Hot Coffee"], ["created_at", "2020-09-21 03:24:46.376054"], ["updated_at", "2020-09-21 03:24:46.376054"]]
---
    def create
        coffee = Coffee.create(coffee_params)