app/controllers/coffee_orders_controller.rb

    def index
        coffeeorders = CoffeeOrder.all
---
SELECT "coffee_orders".* FROM "coffee_orders"

    def show
        coffeeorder =  CoffeeOrder.find(params[:id])
---
SELECT "coffee_orders".* FROM "coffee_orders" WHERE "coffee_orders"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]