app/controllers/orders_controller.rb

SELECT "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        order = Order.find(params[:id])

INSERT INTO "orders" ("user_id", "coffees_order_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 2], ["coffees_order_id", 1], ["created_at", "2020-09-22 15:29:15.462297"], ["updated_at", "2020-09-22 15:29:15.462297"]]
---
    def create
        order = Order.create(order_params)