app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password_digest", "name", "email", "created_at", "updated_at", "auth_token") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
    def create
      user = User.create!(user_params)

SELECT "users".* FROM "users" WHERE "users"."auth_token" = $1 LIMIT $2  [["auth_token", "KS4c3xhxqnMaRgXSYCaErCyz"], ["LIMIT", 1]]
SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = $1  [["user_id", 2]]
---
    def profile
      user = User.find_by!(auth_token: request.headers[:token])
      user_orders = user.orders