app/models/user.rb

SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "testUser"], ["LIMIT", 1]]
---
    def profile_info
        {user: {username: self.username, email: self.email, name:self.name, orders: self.orders}}